import pandas as pd 

#วิธีการชำระ
paytype_dict = {
    '1':'101',
    '2':'201',
    '3':'102',
    '4':'003',
    '5':'202',
    '6':'009',
    '7':'010',
    '8':'012',
    '9':'603',
    'B':'601',
    'G':'602'
}

#ประเภท
payfor_dict={
    '1':'7001',
    '2':'1001',
    '3':'4001',
    '4':'2009'
}

WM_dict = {
   'เงินโอน': '003',
    'หักล้างหนี้': '009',
    'รถแลก': '010',
    'เงินจอง': '012',
    'เงินสด': '101',
    'เช็ค': '201',
    'ดร๊าฟท์': '202',
    'ปิดบัญชี ยึดรถ': '601',
    'ปิดบัญชี เคลมประกัน': '602',
    'ปิดบัญชี บอกเลิกสัญญา > พิพากษา': '603',
    'บัตรเครดิท': '102',
    'หักจากเงินเดือนพนักงาน': 'E'
}
def start(df,type):
    if type == 1:
        df['paytype_code'] = df['วิธีการชำระ'].map(paytype_dict)
        df['payfor_code'] = df['ประเภทการชำระเงิน'].map(payfor_dict)
        

    elif type ==2:
        df['paytype_code'] = df['ประเภทการชำระ'].map(WM_dict)
          
    return df
#for Wl9 use paramiter start(df,1)     
#for WM9 use paramiter start(df,2)
